#include "Sorts.h"

// Определение на структура A
struct A
{
    // Оператор < е дефиниран, но в този случай просто връща false
    bool operator<(const A& other) const
    {
        return false; // Този оператор не позволява правилно сравняване
    }
};

int main()
{
    // Декларация на указател към масив от тип A, но не е инициализиран
    A* str = nullptr;

    // Извикване на функцията BubbleSort с неинициализиран указател
    // и размер 3. Това ще доведе до неопределено поведение
    BubbleSort(str, 3);

    return 0;
}
