#include <memory>
#include <iostream> 

struct A
{
    // Конструктор, който приема едно цяло число и инициализира член-променливата x
    A(int a) : x(a)
    {
        std::cout << "A(int)" << std::endl; 
    }

    int x; 

    // Деструктор, който извежда съобщение при унищожаване на обект от тип A
    ~A()
    {
        std::cout << "~A()" << std::endl; 
    }
};

int main()
{
    // Създаване на уникален указател, който притежава динамично заделен обект от тип A
    std::unique_ptr<A> ptr(new A(1));

    // Извежда стойността на член-променливата x на обекта, притежаван от уникалния указател
    std::cout << ptr->x << std::endl;

    // При края на блока main, уникалният указател ptr автоматично ще освободи ресурсите, 
    // създавайки съобщение "~A()" при унищожаване на обекта
}
